using System;
using System.Diagnostics.Metrics;
using Microsoft.EntityFrameworkCore;
using TourAgency.Models;
namespace TourAgency.Data.SaveTo
{
    
    public class AddCities
    {
        private readonly AppDbContext _context;
        public AddCities(AppDbContext context)
        {
            _context = context;
        }

        
        private static Dictionary<string, List<string>> container = new Dictionary<string, List<string>>()
        {
            ["Россия"] = new List<string>() { "Анапа", "Архангельск", "Астрахань", "Барнаул", "Белгород", "Благовещенск", "Братск", "Владивосток", "Волгоград", "Воронеж", "Горно-Алтайск", "Екатеринбург", "Иркутск", "Казань", "Калининград", "Караганда", "Кемерово", "Краснодар", "Красноярск", "Магнитогорск", "Минеральные Воды", "Москва", "Мурманск", "Нижневартовск", "Нижнекамск", "Нижний Новгород", "Новосибирск", "Новый Уренгой", "Омск", "Оренбург", "Пермь", "Петропавловск-Камчатский", "Ростов-на-Дону", "Самара", "Санкт-Петербург", "Саратов", "Симферополь", "Сочи", "Сургут", "Сыктывкар", "Томск", "Тюмень", "Улан-Удэ", "Ульяновск", "Уфа", "Хабаровск", "Чебоксары", "Челябинск", "Чита", "Южно-Cахалинск", "Якутск", },
            ["Австралия"] = new List<string>() { "Брисбен", "Мельбурн", "Сидней" },
            ["Австрия"] = new List<string>() { "Вена" , "Зальцбург", "Инсбрук" },
            ["Азербайджан"] = new List<string>() { "Баку", "Гянджа" },
            ["Аргентина"] = new List<string>() { "Буэнос-Айрес" },
            ["Белоруссия"] = new List<string>() { "Минск" },
            ["Болгария"] = new List<string>() { "Бургас", "Варна", "София", "Пловдив"},
            ["Бразилия"] = new List<string>() { "Рио-де-Жанейро" , "Сан-Паулу" },
            ["Великобритания"] = new List<string>() { "Лондон" },
            ["Вьетнам"] = new List<string>() { "Ньячанг" , "Фу Куок" , "Хошимин" },
            ["Германия"] = new List<string>() { "Берлин", "Дюссельдорф", "Мюнхен", "Франкфурт", },
            ["Греция"] = new List<string>() { "Афины", "Ираклион", "Каламата", "Корфу", "Кос", "Закинтос", "Родос", "Салоники"},
            ["Доминиканская республика"] = new List<string>() {  "Пунта Кана"},
            ["Египет"] = new List<string>() { "Каир", "Луксор", "Марса Алам", "Таба", "Хургада", "Шарм эль Шейх"},
            ["Индия"] = new List<string>() { "Гоа", "Дели", "Тривандрум"},
            ["Индонезия"] = new List<string>() { "Денпасар" },
            ["Испания"] = new List<string>() { "Аликанте", "Барселона", "Ибица", "Лас Пальмас", "Мадрид", "Малага", "Пальма де Майорка", "Севилья", "Тенерифе" },
            ["Италия"] = new List<string>() { "Анкона", "Бари", "Бергамо", "Венеция", "Верона", "Генуя", "Кальяри (Сардиния)", "Катания (Сицилия)", "Ламециа Терме", "Милан", "Неаполь", "Палермо (Сицилия)", "Олбия (Сардиния)", "Рим", "Римини", "Триест", "Тревизо", "Турин", "Флоренция", "Форли", },
            ["Казахстан"] = new List<string>() { "Актобе", "Алматы", "Астана", "Павлодар", "Усть-Каменогорск", "Шымкент"},
            ["Катар"] = new List<string>() {"Доха"},
            ["Кипр"] = new List<string>() { "Ларнака", "Пафос"},
            ["Китай"] = new List<string>() { "Гонконг", "Пекин", "Санья", "Шанхай"},
            ["Куба"] = new List<string>() { "Варадеро", "Гавана" },
            ["Маврикий"] = new List<string>() {"Порт Луи" },
            ["Мальдивы"] = new List<string>() { "Мале"},
            ["Мекскика"] = new List<string>() { "Канкун", "Мехико"},
            ["ОАЭ"] = new List<string>() { "Абу Даби", "Дубай", "Шарджа"},
            ["Румыния"] = new List<string>() { "Бухарест", "Иаси", "Клуж-Напока", "Тимишоара"},
            ["Сейшелы"] = new List<string>() { "Маэ", "Прале"},
            ["Сингапур"] = new List<string>() {  "Сингапур"},
            ["Тайланд"] = new List<string>() { "Бангкок", "Краби", "Паттайя", "Пхукет"},
            ["Тунис"] = new List<string>() { "Джерба", "Монастир", "Тунис"},
            ["Турция"] = new List<string>() { "Алания", "Анталия", "Бодрум", "Бурса", "Даламан", "Измир", "Стамбул", "Эрзурум" },
            ["Франция"] = new List<string>() { "Лион", "Марсель", "Ницца", "Париж", "Шамбери"},
            ["Хорватия"] = new List<string>() { "Дубровник","Пула" },
            ["Черногория"] = new List<string>() { "Подгорица" },
            ["Чехия"] = new List<string>() { "Брно", "Карловы Вары", "Пардубице", "Прага" },
            ["Швейцария"] = new List<string>() { "Берн", "Женева", "Цюрих"},
        };

        public void AddData()
        {
            foreach (var i in container)
            {
                foreach (var j in i.Value)
                {
                    var country = _context.Countries.FirstOrDefault(model => model.name == i.Key);
                    if (country == null)
                    {
                        _context.Countries.Add(new Models.Country()
                        {
                            name = i.Key,
                            flag = ""
                        }) ;
                        _context.SaveChanges();
                        country = _context.Countries.FirstOrDefault(model => model.name == i.Key);
                    }
                    _context.cities.Add(new Models.City()
                    {
                        country = country,
                        name = j
                    });
                }
            }
            _context.SaveChanges();
        }
    }
}
