using System;
using System.ComponentModel;
using System.Xml.Linq;
using Microsoft.EntityFrameworkCore;
using TourAgency.Data;

namespace TourAgency.Data.SaveTo
{
    public class AddRegion
    {
        private AppDbContext _context;
        public AddRegion(AppDbContext context)
        {
            _context = context;
        }

        private static Dictionary<string, List<string>> container = new Dictionary<string, List<string>>()
        {
            ["Barbados"] = new List<string>() {"Крайст-Черч", "Сент-Джеймс", "Сент-Питер" },
            ["Vietnam"] = new List<string>() {"Нья Чанг","о. Фу Кок","Фан Тьет", "Ханой", "Хо Ши Мин", "Хюэ"},
            ["Greece"] = new List<string>() { "Анависсос", "Аниссарас", "Аттика", "Афины", "Вульягмени", "Глифада", "Западный Пелопоннес", "Иксия", "Ираклион", "Калифея", "Киллини", "Лагонисси", "Линдос", "Лутраки", "Миконос", "о.Кос", "Панормо", "Ретимно", "Родос", "Салоники", "Фалираки", "Халкидики", "Хания", "Херсониссос", "Элунда", "Ялиссос" },
            ["Dominican Republic"] = new List<string>() { "Пунта Кана", "Бока Чика", "Ла Романа", "Пуэрто Плата", "Самана", "Уверо Альтo", "Хуан Долио" },
            ["Indonesia"] = new List<string>() { "Gili Travangan", "Джимбаран", "Кута", "Ловина", "Нуса Дуа", "о. Бинтан", "о. Ломбок", "Санур", "Семиняк", "Танджунг Беноа", "Убуд", "Улувату" },
            ["Spain"] = new List<string>() { "Барселона", "Бенидорм", "Валенсия", "Гиа де Изора", "Гранада", "Гуардамар Дель Сегура", "Калелья", "Камбрилс", "Ла Пинеда", "Лас Пальмас", "Лорет де Мар", "Мадрид", "Малграт Де Мар", "Маспаломас", "о. Ибица", "о. Майорка", "Оропеса дель Мар", "Плайа дел Инглес", "побережье Коста Адехе", "побережье Лас Америкас", "побережье Лос Гигантес", "побережье Плайя Параисо", "Салоу", "Толедо", "Тосса де Mар" },
            ["Italy"] = new List<string>() { "Alghero", "Cан Джулиано Терме", "Cан Кашиано", "Stintino", "Trento", "Абано Терме", "Алассио", "Альба ди Канацеи", "Альбарелла", "Амальфи", "Анакапри", "Анкона", "Анцио", "Аренцано", "Бавено (озеро Маджоре)", "Барано", "Бардолино (озеро Гарда)", "Бардонеккья", "Бари", "Белладжьо (озеро Комо)", "Бергамо", "Болонья", "Бордигера", "Бормио", "Брешиа", "Валь ди Фасса - Канацеи", "Варацце", "Варенна (озеро Комо)", "Вариньяна", "Венеция", "Верона", "Виареджио", "Виго ди Фасса", "Вольтерра", "Гаэта", "Генуя", "Дезенцано (озеро Гарда)", "Джиардини Наксос", "Диано Марина", "Замки Италии", "Искья Порто (о. Искья)", "Каденаббиа (озеро Комо)", "Казамиччиола", "Кальяри", "Камольи", "Кампителло Ди Фасса", "Капри", "Катанья", "Каттолика", "Комо (озеро Комо)", "КОНГРЕССЫ", "Кортина ди Ампеццо", "Курмайор", "Ла Туиль", "Лакко Амено", "Летойянни", "Ливиньо", "Лидо ди Езоло", "Лидо ди Камайоре", "Лидо ди Фонди", "Лукка", "Мадонна ди Кампильо", "Майори", "Марина дель Кантоне", "Марина ди Масса", "Марина ди Пьетрасанта", "Маццин", "Местре", "Меццегра (озеро Комо)", "Милан", "Милано Мариттима", "Минори", "Мольтрасио (озеро Комо)", "Монтальчино", "Монтегротто Терме", "Монтекатини", "Моэна", "Неаполь", "Олбия", "Ортизеи", "Палермо", "Палинуро", "Парма", "Пениа ди Канацеи", "Перуджа", "Пестум", "Пиза", "Пинцоло", "Позитано", "Портофино", "Поцца ди Фасса", "Презолана ", "Пьетра Лигуре", "Равелло", "Равенна", "Рапалло", "Рива дель Гарда (озеро Гарда)", "Рим", "Римини", "Риччионе", "Роверето ", "Сабаудия", "Сальсомаджоре Терме", "Сан Анжело", "Сан Ремо", "Сан Феличе Чирчео", "Сант Алессио Сикуло", "Санта Маргерита Лигуре", "Сельва ди Валь Гардена", "Сестри Леванте", "Сестриер", "Сиена", "Сиракузы", "Сирмионе (озеро Гарда)", "Сорренто", "Спелло", "Сперлонга", "Споторно", "Стреза (озеро Маджоре)", "Таормина", "Террачина", "Тиррения", "Тремеццо (озеро Комо)", "Турин", "Финале Лигуре", "Флоренция", "Форио", "Формия", "Форте дей Марми", "Фратте Терме ди Бертиноро", "Фьюджи", "Чезенатико", "Челле Лигуре", "Червиния", "Червия", "Черноббьо (озеро Комо)", "Эльба" },
            ["Cape Verde"] = new List<string>() { "О. Боавишта", "О. Сал" },
            ["Cambodia"] = new List<string>() { "Пном Пень", "Сиануквиль", "Сим Рип" },
            ["Qatar"] = new List<string>() { "Доха" },
            ["Cyprus"] = new List<string>() { },
            ["China"] = new List<string>() { "Cанья (Coral Bay)", "Cанья (Shimei Bay)", "Санья (DADONGHAI)", "Санья (Nantian)", "Санья (Peninsula Dragon Bay)", "Санья (Qi Xian Lin)", "Санья (SANYA BAY)", "Санья (Xinglong) ", "Санья (YALONG BAY)", "Боао", "Гон Конг", "Гуанчжоу", "Далянь", "Лоян", "Пекин", "Санья (Haitang Bay)", "Сучжоу", "Шанхай" },
            ["Cuba"] = new List<string>() { "ВАРАДЕРО", "ГАВАНА", "о. КАЙО ГИЛЬЕРМО", "о. КАЙО КОКО", "о. КАЙО ЛАРГО", "о. КАЙО ЭНСЕНАЧОС", "о. САНТА МАРИЯ", "ОЛЬГИН" },
            ["Mauritius"] = new List<string>() { "Порт-Луи" },
            ["Malaysia"] = new List<string>() { "Куала Лумпур", "о. Борнео", "о. Лангкави", "о. Пангкор", "о. Пенанг", "о. Реданг", "о. Сипадан", "о. Тиоман" },
            ["Maldives"] = new List<string>() { "Мале" },
            ["Mexico"] = new List<string>() { "Акапулько", "Канкун", "Косумель", "Лос-Кабос", "Мехико-сити", "Плайя Дель Кармэн", "Пуэрто-Вальярта", "Ривьера Майя" },
            ["UAE"] = new List<string>() { "Абу-Даби", "Аджман", "Дубаи", "Дубай (городские отели)", "Дубай (отели в пустыне)", "Дубай (пальма)", "Дубай (пляжные отели)", "Рас Аль Хайма", "Фуджейра", "Шарджа" },
            ["Russia"] = new List<string>() { "Горно-Алтайск", "Осташков" },
            ["Seychelles"] = new List<string>() { "o. Cанта Анна", "o. Cилуэтт", "o. Маэ", "o.Прале", "о. Альфонс", "о. Бёрд", "о. Денис", "о. Дерош", "о. Кузина", "о. Ла Диг", "о. Норт", "о. Раунд", "о. Серф", "о. Филисити", "о. Фрегат" },
            ["Singapore"] = new List<string>() { "Сингапур", "о. Сентоза" },
            ["Thailand"] = new List<string>() { "Бангкок", "Краби", "о. Куд", "о. Ланта", "о. Пи - Пи", "о. Пхукет", "о. Сaмуи", "о. Самет", "о. Чанг", "Паттайя" },
            ["Philippines"] = new List<string>() { "Coron", "Pamalican", "Puerto Princesa City", "Taytay", "Uson", "Манила", "о. Боракай", "о. Бохоль", "о. Димакия", "о. Себу" },
            ["France"] = new List<string>() { "Биарриц", "Довиль", "Канны", "Монако", "Мон-Сен-Мишель", "Ницца", "Париж", "Руан", "Сен-Мало", "Этрета" },
            ["Croatia"] = new List<string>() { },
            ["Sri Lanka"] = new List<string>() { "Коломбо", "Аунгалла", "Бентота", "Берувала", "Ваддува", "Велигама", "Галле", "Дамбулла", "Диквелла", "Индурува", "Калутара", "Канди", "Коггала", "Косгода", "Маравила", "Маунт Лавиния", "Мирисса", "Негомбо", "Нувара Элия", "Пасикуда", "Сигирия", "Тангалле", "Тринкомале", "Хабарана", "Хиккадува" },
            ["Jamaica"] = new List<string>() { "Вестморленд", "Кингстон", "Монтего Бей", "Негрил", "Очо Риос", "Ранeвэй Бей" },
        };


        public void AddEntity()
        {
            foreach (var i in container)
            {
                foreach (var j in i.Value)
                {
                    _context.Regions.Add(new Models.Region()
                    {
                        name = j,
                        country = _context.Countries.FirstOrDefault(m => m.flag == i.Key)
                    });
                }
            }
            _context.SaveChanges();
        }
    }
}

